In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv('data/messy_customer_sales_data.csv')
df

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,M,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10195,CUST10767,Robert Lewis,female,35.0 years,delhi,2020-12-08,2025-01-25,24167.0,9.0,barrycrane@example.net,5004696571,InDia
10196,NaN,Diane Evans,M,53.0,bangalore,2023-12-31,2025-05-07,11639.0,7.0,lisadennis@example.net,5200349941,IND
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55.0,NaN,2021-03-16,2025-05-14,18827.0,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [4]:
# step 1 : check data type

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10200 entries, 0 to 10199
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         9177 non-null   object
 1   Name                10200 non-null  object
 2   Gender              9174 non-null   object
 3   Age                 9249 non-null   object
 4   City                9184 non-null   object
 5   Signup_Date         10200 non-null  object
 6   Last_Purchase_Date  9188 non-null   object
 7   Purchase_Amount     9179 non-null   float64
 8   Feedback_Score      9177 non-null   float64
 9   Email               10200 non-null  object
 10  Phone_Number        10200 non-null  int64
 11  Country             9468 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 956.4+ KB

In [5]:
# step 2 : summary statastics => yaha se hame outlier , neg value pata chal gai

df.describe()

       Purchase_Amount  Feedback_Score  Phone_Number
count     9.179000e+03     9177.000000  1.020000e+04
mean      2.909013e+04        5.479351  4.979974e+09
std       2.086971e+05        2.867123  2.902593e+09
min      -5.000000e+02        1.000000  9.208990e+05
25%       1.229500e+04        3.000000  2.449157e+09
50%       2.433000e+04        5.000000  4.988639e+09
75%       3.713000e+04        8.000000  7.510448e+09
max       9.999999e+06       10.000000  9.994402e+09

In [8]:
# step 3 => check missin value

df.isnull().sum()

Customer_ID           1023
Name                     0
Gender                1026
Age                    951
City                  1016
Signup_Date              0
Last_Purchase_Date    1012
Purchase_Amount       1021
Feedback_Score        1023
Email                    0
Phone_Number             0
Country                732
dtype: int64

In [11]:
# step 4 => check krna h ki data ke columns me kitna % missing/null values presnt h

df.isnull().sum()/len(df)*100

Customer_ID           10.029412
Name                   0.000000
Gender                10.058824
Age                    9.323529
City                   9.960784
Signup_Date            0.000000
Last_Purchase_Date     9.921569
Purchase_Amount       10.009804
Feedback_Score        10.029412
Email                  0.000000
Phone_Number           0.000000
Country                7.176471
dtype: float64

In [13]:
# find columns with few unique values and how many times they appears.from this we can do correct fromating in th columns

for col in df.columns:
    if df[col].nunique() < 20:
        print(df[col].value_counts())
        print('_'*50)

Gender
f         1184
M         1171
m         1163
F         1157
MALE      1131
female    1128
male      1121
FEMALE    1119
Name: count, dtype: int64
__________________________________________________
City
Kolkata       820
Mumbai        812
Chennai       784
Bangalore     773
Hyderabad     770
Delhi         763
CHENNAI       404
KOLKATA       395
MUMBAI        393
hyderabad     384
bangalore     383
DELHI         378
delhi         369
BANGALORE     363
HYDERABAD     360
mumbai        352
chennai       343
kolkata       338
Name: count, dtype: int64
__________________________________________________
Feedback_Score
2.0     952
4.0     947
7.0     938
6.0     927
3.0     913
8.0     912
1.0     907
9.0     903
10.0    901
5.0     877
Name: count, dtype: int64
__________________________________________________
Country
India    7132
IND       793
india     772
InDia     771
Name: count, dtype: int64
__________________________________________________

## *Handling missing values*

In [14]:
# check missin value

df.isnull().sum()

Customer_ID           1023
Name                     0
Gender                1026
Age                    951
City                  1016
Signup_Date              0
Last_Purchase_Date    1012
Purchase_Amount       1021
Feedback_Score        1023
Email                    0
Phone_Number             0
Country                732
dtype: int64

In [16]:
# Remove missng values from customer ID column , coz customer Id must be unique

df.dropna(subset = ['Customer_ID'],inplace = True)

# check values remove or not of Customer_ID
df.isnull().sum()

Customer_ID             0
Name                    0
Gender                934
Age                   859
City                  918
Signup_Date             0
Last_Purchase_Date    914
Purchase_Amount       927
Feedback_Score        905
Email                   0
Phone_Number            0
Country               664
dtype: int64

In [18]:
# now rows are decrease from 10k to 9k

df

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,M,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10194,CUST6146,Cody Thompson,f,40.0,NaN,2024-08-21,2024-10-26,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10195,CUST10767,Robert Lewis,female,35.0 years,delhi,2020-12-08,2025-01-25,24167.0,9.0,barrycrane@example.net,5004696571,InDia
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55.0,NaN,2021-03-16,2025-05-14,18827.0,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [20]:
# ab ham imputation perform krege on numeric column , remove krege 25 yrs, yrs26 ,etc entries.. ham inmese only num ie, 25,26 ye extract krege
# 34.0 years aise values remove krna h or only unmese numnber extract krna h ie, 34
# df['Age']

df['Age'].unique()

array(['52.0', '51.0 years', '62.0', '40.0', '41.0', nan, '18.0',
       '43.0 years', '40.0 years', '26.0', '32.0', '22.0', '59.0', '65.0',
       '61.0', '31.0', '54.0 years', '55.0', '69.0', '61.0 years', '24.0',
       '63.0', '19.0', '50.0', '56.0', '36.0', '68.0', '43.0', '38.0',
       '27.0', '57.0 years', '23.0', '25.0', '66.0', '28.0', '30.0',
       '46.0', '48.0', '20.0', '37.0', '67.0', '51.0', '35.0', '58.0',
       '29.0', 'nan years', '39.0', '49.0', '47.0', '42.0', '44.0',
       '64.0', '53.0', '60.0', '59.0 years', '45.0', '21.0', '34.0',
       '54.0', '48.0 years', '46.0 years', '33.0', '57.0', '30.0 years',
       '58.0 years', '35.0 years', '34.0 years', '69.0 years', '250',
       '19.0 years', '27.0 years', '53.0 years', '65.0 years',
       '66.0 years', '44.0 years', '49.0 years', '25.0 years',
       '23.0 years', '62.0 years', '41.0 years', '33.0 years',
       '28.0 years', '22.0 years', '20.0 years', '42.0 years',
       '45.0 years', '3', '63.0 years', '37.0 years', '38.0 years',
       '55.0 years', '18.0 years', '36.0 years', '67.0 years',
       '29.0 years', '39.0 years', '31.0 years', '47.0 years',
       '52.0 years', '-10', '60.0 years', '24.0 years', '26.0 years',
       '21.0 years', '64.0 years', '50.0 years', '68.0 years',
       '32.0 years', '56.0 years'], dtype=object)

In [23]:
# cleans the Age column by extracting only numeric values and removing text like "years" or "yrs" using regular expressions.
import re
def extract_age(age):
    age_num = re.findall('[0-9]+', str(age))
    if len(age_num) > 0:
        return age_num[0]
    else :
        return age
df['Age'] = df['Age'].apply(lambda x : extract_age(x))

df['Age']

0        52
1        51
2        62
3        40
4        41
         ..
10194    40
10195    35
10197    25
10198    55
10199    34
Name: Age, Length: 9177, dtype: object

In [24]:
# check age after extractig numbers(age) from text then Age column looks like
df['Age'].unique()

array(['52', '51', '62', '40', '41', nan, '18', '43', '26', '32', '22',
       '59', '65', '61', '31', '54', '55', '69', '24', '63', '19', '50',
       '56', '36', '68', '38', '27', '57', '23', '25', '66', '28', '30',
       '46', '48', '20', '37', '67', '35', '58', '29', 'nan years', '39',
       '49', '47', '42', '44', '64', '53', '60', '45', '21', '34', '33',
       '250', '3', '10'], dtype=object)

In [27]:
# now handle 'nan years' this value inside Age column
# it only returns only valid age with no 'nan years' value in Age column
df_age = df[df['Age'] != 'nan years']['Age'] 
df_age

0        52
1        51
2        62
3        40
4        41
         ..
10194    40
10195    35
10197    25
10198    55
10199    34
Name: Age, Length: 9120, dtype: object

In [30]:
# Now calculate median age 
# it remove nan value from df_age var temprorily and covert its type into int for calculating median.
# we convert its type coz we are calculating mdian so we need int values and its orginal type is object
    
age_median = int(df_age.dropna().astype('int64').median())
age_median

43

In [31]:
# now fill 'nan years' with median 43 permenetly

df.replace('nan years',age_median,inplace = True)

In [33]:
# and also fill value nan with median 43 permenetly

df['Age'].fillna(age_median)

0        52
1        51
2        62
3        40
4        41
         ..
10194    40
10195    35
10197    25
10198    55
10199    34
Name: Age, Length: 9177, dtype: object

In [35]:
# check Age column after removeing nan and 'nan year'
# here 250 is very big age so its a outlier

df['Age'].unique()

array(['52', '51', '62', '40', '41', 43, '18', '43', '26', '32', '22',
       '59', '65', '61', '31', '54', '55', '69', '24', '63', '19', '50',
       '56', '36', '68', '38', '27', '57', '23', '25', '66', '28', '30',
       '46', '48', '20', '37', '67', '35', '58', '29', '39', '49', '47',
       '42', '44', '64', '53', '60', '45', '21', '34', '33', '250', '3',
       '10'], dtype=object)

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9177 entries, 0 to 10199
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         9177 non-null   object
 1   Name                9177 non-null   object
 2   Gender              8243 non-null   object
 3   Age                 9177 non-null   object
 4   City                8259 non-null   object
 5   Signup_Date         9177 non-null   object
 6   Last_Purchase_Date  8263 non-null   object
 7   Purchase_Amount     8250 non-null   float64
 8   Feedback_Score      8272 non-null   float64
 9   Email               9177 non-null   object
 10  Phone_Number        9177 non-null   int64
 11  Country             8513 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 932.0+ KB

In [39]:
# now ham Purchase_Amount col me k missing values ko handle krte h
# isko direct median of Purchase_Amount se fill krdege missing value ko coz isme Purchase_Amount col ka DT yeh alredy numeric h not an object so

df['Purchase_Amount'].fillna(df['Purchase_Amount'].median())

0        26944.0
1        44152.0
2        31745.0
3        39674.0
4        24268.0
          ...
10194    35101.0
10195    24167.0
10197    43832.0
10198    18827.0
10199    35211.0
Name: Purchase_Amount, Length: 9177, dtype: float64

In [40]:
# check Purchase_Amount column after removeing missing values

df.isnull().sum()

Customer_ID             0
Name                    0
Gender                934
Age                     0
City                  918
Signup_Date             0
Last_Purchase_Date    914
Purchase_Amount         0
Feedback_Score        905
Email                   0
Phone_Number            0
Country               664
dtype: int64

In [42]:
# now ham Feedback_Score col me k missing values ko handle krte h
# isko direct mode of  Feedback_Score se fill krdege missing value ko coz isme  Feedback_Score col ka DT yeh alredy numeric as well as yeh decrete value h

df['Feedback_Score'].fillna(df['Feedback_Score'].mode()[0])

0         1.0
1         2.0
2         2.0
3         1.0
4         8.0
         ...
10194     1.0
10195     9.0
10197     2.0
10198    10.0
10199    10.0
Name: Feedback_Score, Length: 9177, dtype: float64

In [43]:
# check Feedback_Score after removeing missing values

df.isnull().sum()

Customer_ID             0
Name                    0
Gender                934
Age                     0
City                  918
Signup_Date             0
Last_Purchase_Date    914
Purchase_Amount         0
Feedback_Score          0
Email                   0
Phone_Number            0
Country               664
dtype: int64

In [51]:
# now handle missing values of cols Gender,City,Country in one go coz yeh tino columns ka DT object h means string h , so ham isme mode apply krege

for col in ['Gender','City','Country']:
    df[col].fillna(df[col].mode()[0],inplace=True)

In [52]:
# check 'Gender','City','Country' after removeing missing values

df.isnull().sum()

Customer_ID             0
Name                    0
Gender                  0
Age                     0
City                    0
Signup_Date             0
Last_Purchase_Date    914
Purchase_Amount         0
Feedback_Score          0
Email                   0
Phone_Number            0
Country                 0
dtype: int64

In [57]:
# now ab ham Last_Purchase_Date col ke missing values ko handle krege with forward fill

df['Last_Purchase_Date'].ffill()
df.isnull().sum()

Customer_ID           0
Name                  0
Gender                0
Age                   0
City                  0
Signup_Date           0
Last_Purchase_Date    0
Purchase_Amount       0
Feedback_Score        0
Email                 0
Phone_Number          0
Country               0
dtype: int64

## *Fixing Inconsistent Formatting*

female,
F,
male,
M,
FEMALe,etc

fix this formate into onle male and female

In [59]:
# check incosistence formating in Gender col

df['Gender'].unique()

array(['m ', 'M', 'F', 'FEMALE', 'f ', 'male', 'MALE', 'female'],
      dtype=object)

In [60]:
# now convert them into to lower case - temporiry

df['Gender'].str.lower()

0            m
1             m
2             f
3        female
4            f
          ...
10194        f
10195    female
10197        m
10198    female
10199    female
Name: Gender, Length: 9177, dtype: object

In [62]:
# now check unique values after converting lower - temprorily

df['Gender'].str.lower().unique()

array(['m ', 'm', 'f', 'female', 'f ', 'male'], dtype=object)

In [64]:
# now remove white spaces from Gender col

df['Gender'].str.lower().str.strip()

0             m
1             m
2             f
3        female
4             f
          ...
10194         f
10195    female
10197         m
10198    female
10199    female
Name: Gender, Length: 9177, dtype: object

In [71]:
# now check unique values after removeing white space and converting it into lower case - temprory

df['Gender'] = df['Gender'].str.lower().str.strip()
df['Gender']

0             m
1             m
2             f
3        female
4             f
          ...
10194         f
10195    female
10197         m
10198    female
10199    female
Name: Gender, Length: 9177, dtype: object

In [72]:
# now convert m and f into male and female - permently

df['Gender'].replace({
    'm':'male',
    'f':'female'
}, inplace = True)

In [73]:
# now check unique values after applying all filters
df['Gender'].unique()

array(['male', 'female'], dtype=object)

In [74]:
# now formate the City col

df['City'].unique()

array([' KOLKATA ', ' Kolkata ', ' hyderabad ', ' CHENNAI ', ' kolkata ',
       ' BANGALORE ', ' Hyderabad ', ' HYDERABAD ', ' Mumbai ',
       ' chennai ', ' Delhi ', ' bangalore ', ' Bangalore ', ' delhi ',
       ' Chennai ', ' MUMBAI ', ' DELHI ', ' mumbai '], dtype=object)

In [75]:
# now remove white spaces
df['City'].str.strip()

0          KOLKATA
1          Kolkata
2        hyderabad
3        hyderabad
4          CHENNAI
           ...
10194      Kolkata
10195        delhi
10197    hyderabad
10198      Kolkata
10199    HYDERABAD
Name: City, Length: 9177, dtype: object

In [79]:
# now capatalize start word of letter and remove whitespae

df['City'] = df['City'].str.strip().str.capitalize()

In [80]:
# now check unique values after applying all filters

df['City'].unique()

array(['Kolkata', 'Hyderabad', 'Chennai', 'Bangalore', 'Mumbai', 'Delhi'],
      dtype=object)

In [81]:
# Now apply formating in Country col
# ccheck unique values in Country col

df['Country'].unique()

array(['India', 'india', 'InDia', 'IND'], dtype=object)

In [87]:
# now replace all wrong formate text into write formate ie, India

df['Country'] = df['Country'].replace({
    'india' : 'India',
    'InDia' : 'India',
    'IND'   : 'India'
})

In [88]:
# Check all formating applies correctly or not on col 'Country' 
df['Country'].unique()

array(['India'], dtype=object)

In [89]:
df

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,male,52,Kolkata,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,male,51,Kolkata,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,India
2,CUST3754,Brittney Martinez,female,62,Hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,female,40,Hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,India
4,CUST5683,Matthew Carroll,female,41,Chennai,2024-04-05,2024-12-15,24268.0,8.0,denise84@example.org,2665569480,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10194,CUST6146,Cody Thompson,female,40,Kolkata,2024-08-21,2024-10-26,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10195,CUST10767,Robert Lewis,female,35,Delhi,2020-12-08,2025-01-25,24167.0,9.0,barrycrane@example.net,5004696571,India
10197,CUST6315,Joshua Martinez,male,25,Hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,female,55,Kolkata,2021-03-16,2025-05-14,18827.0,10.0,dawn84@example.org,2987564247,India
10199,CUST6588,David Potter,female,34,Hyderabad,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

## *Handling Duplicate values*

In [97]:
# means 163 records/rows duplicate h

df[df.duplicated()].shape

(163, 12)

In [99]:
# now drop all duplicates records

df.drop_duplicates(inplace = True)

In [102]:
# check duplicates remove or not
df[df.duplicated()].shape

(0, 12)

In [105]:
# now check Customer_ID is unique or contain any dublicates .coz all customer Id should be unique

df['Customer_ID'].value_counts()

Customer_ID
CUST3693    2
CUST6833    2
CUST5341    2
CUST1002    2
CUST9950    2
           ..
CUST1386    1
CUST8835    1
CUST7335    1
CUST3085    1
CUST5957    1
Name: count, Length: 9000, dtype: int64

In [106]:
# In above output it stll contain customer id duplicates after droping duplicate also still contain duplicate
# now check why dublicate customer id shows

df[df['Customer_ID'] == 'CUST3693']

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
3967,CUST3693,Chad Dominguez,female,3,Chennai,2022-01-20,2025-02-20,24268.0,7.0,donnaacosta@example.net,7342776270,India
4953,CUST3693,Chad Dominguez,female,54,Chennai,2022-01-20,2025-02-20,24268.0,7.0,donnaacosta@example.net,7342776270,India

In [109]:
# in above result it contain Age is diff in this customer 'CUST3693' id , thats why it shows duplicates values in customer if coz of some customer records are diff records
# so we only keep first occurnce of duplicate record of customer id coz customer id must be unique

df.drop_duplicates(subset = ['Customer_ID'],inplace = True)

In [110]:
# now check shape
df.shape

(9000, 12)

## *Correecting DataType of Columns*

In [111]:
# check info od datafrane

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9000 entries, 0 to 10198
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         9000 non-null   object
 1   Name                9000 non-null   object
 2   Gender              9000 non-null   object
 3   Age                 9000 non-null   object
 4   City                9000 non-null   object
 5   Signup_Date         9000 non-null   object
 6   Last_Purchase_Date  9000 non-null   object
 7   Purchase_Amount     9000 non-null   float64
 8   Feedback_Score      9000 non-null   float64
 9   Email               9000 non-null   object
 10  Phone_Number        9000 non-null   int64
 11  Country             9000 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 914.1+ KB

In [114]:
# now you can see Age is object ,Signup_Date is object type , Last_Purchase_Date is object type
# so we have to change the type of these columns

# for Age object -> int64
df['Age'] = df['Age'].astype('int64')

In [115]:
# now check Age data type is change or not
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9000 entries, 0 to 10198
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         9000 non-null   object
 1   Name                9000 non-null   object
 2   Gender              9000 non-null   object
 3   Age                 9000 non-null   int64
 4   City                9000 non-null   object
 5   Signup_Date         9000 non-null   object
 6   Last_Purchase_Date  9000 non-null   object
 7   Purchase_Amount     9000 non-null   float64
 8   Feedback_Score      9000 non-null   float64
 9   Email               9000 non-null   object
 10  Phone_Number        9000 non-null   int64
 11  Country             9000 non-null   object
dtypes: float64(2), int64(2), object(8)
memory usage: 914.1+ KB

In [119]:
# now change data typ of columns Signup_Date  and Last_Purchase_Date

pd.to_datetime(df['Signup_Date'])
pd.to_datetime(df['Last_Purchase_Date'])

0       2025-05-17
1       2025-07-22
2       2024-12-08
3       2025-10-02
4       2024-12-15
           ...
10193   2025-06-30
10194   2024-10-26
10195   2025-01-25
10197   2025-01-11
10198   2025-05-14
Name: Last_Purchase_Date, Length: 9000, dtype: datetime64[ns]

In [120]:
# now above changes store permently in both colmns

df['Signup_Date'] = pd.to_datetime(df['Signup_Date'])
df['Last_Purchase_Date'] = pd.to_datetime(df['Last_Purchase_Date'])

In [121]:
# now check all data types shows correctly or not

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9000 entries, 0 to 10198
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         9000 non-null   object
 1   Name                9000 non-null   object
 2   Gender              9000 non-null   object
 3   Age                 9000 non-null   int64
 4   City                9000 non-null   object
 5   Signup_Date         9000 non-null   datetime64[ns]
 6   Last_Purchase_Date  9000 non-null   datetime64[ns]
 7   Purchase_Amount     9000 non-null   float64
 8   Feedback_Score      9000 non-null   float64
 9   Email               9000 non-null   object
 10  Phone_Number        9000 non-null   int64
 11  Country             9000 non-null   object
dtypes: datetime64[ns](2), float64(2), int64(2), object(6)
memory usage: 914.1+ KB